{"American Amber Ale": {"pairing1": "Barbeque", "pairing2": "Medium Cheddar", "pairing3": "Banana Pound Cake", "pairing1img": "bbq.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "PoundCake.jpg", "glassimg": "tulip.jpg", "description": "The American amber ale has medium-high to high maltiness with medium to low caramel character. They are characterized by American-variety hops, which produce medium hop bitterness, flavor and aroma. American ambers are usually darker in color, have more caramel flavor and less hop aromatics, and may have more body. This style was first made popular by brewers from California and the Pacific Northwest."}, "American Amber Lager": {"pairing1": "Grilled Meats and Vegetables", "pairing2": "White Cheddar", "pairing3": "Fruit Desserts", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "FruitDessert.jpg", "glassimg": "tulip.jpg", "description": "A widely available, sessionable craft beer style that showcases both malt and hops. Amber lagers are a medium-bodied lager with a toasty or caramel-like malt character. Hop bitterness can range from very low to medium-high. Brewers may use decoction mash and dry-hopping to achieve advanced flavors."}, "American Barley Wine": {"pairing1": "Beef Cheek", "pairing2": "Strong Blue Cheese", "pairing3": "Rich Desserts", "pairing1img": "BeefCheek.jpg", "pairing2img": "Bleu.jpg", "pairing3img": "ChocoCake.jpg", "glassimg": "snifter.jpg", "description": "American barley wine ranges from amber to deep red/copper-garnet in color. A caramel and/or toffee aroma and flavor are often part of the malt character along with high residual malty sweetness. Complexity of alcohols is evident. Fruity-ester character is often high. As with many American versions of a style, this barley wine ale is typically more hop-forward and bitter than its U.K. counterpart. Low levels of age-induced oxidation can harmonize with other flavors and enhance the overall experience. Sometimes sold as vintage releases."}, "American Black Ale": {"pairing1": "Grilled Shrimp and Grits", "pairing2": "Blue Cheeses, Aged Gouda", "pairing3": "Chocolate Truffles", "pairing1img": "ShrimpGrits.jpg", "pairing2img": "Bleu.jpg", "pairing3img": "ChocoTruffles.jpg", "glassimg": "tulip.jpg", "description": "The American black ale is characterized by the perception of caramel malt and dark roasted malt flavor and aroma. Hop bitterness is perceived to be medium-high to high. Hop flavor and aroma are medium-high. Fruity, citrus, piney, floral and herbal character from hops of all origins may contribute to the overall experience. This beer is often called a black IPA or Cascadian dark ale."}, "American Brown Ale": {"pairing1": "Grilled Meats and Vegetables", "pairing2": "Aged Gouda", "pairing3": "Pear Fritters", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "Fritter.jpg", "glassimg": "pint.jpg", "description": "Roasted malt, caramel-like and chocolate-like characters should be of medium intensity in both flavor and aroma for the American brown ale. American-style brown ales have evident low to medium hop flavor and aroma and medium to high hop bitterness. The history of this style dates back to U.S. homebrewers who were inspired by English-style brown ales and porters. It sits in flavor between those British styles and is more bitter than both."}, "American Cream Ale": {"pairing1": "Salads, Mild Shellfish", "pairing2": "Monterey Jack", "pairing3": "Lemon Custard Tart", "pairing1img": "ShellfishSalad.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "LemonCustard.jpg", "glassimg": "flute.jpg", "description": "The American cream ale is a mild, pale, light-bodied ale, made using a warm fermentation (top or bottom fermenting yeast) and cold lagering. Despite being called an ale, when being judged in competitions it is acceptable for brewers to use lager yeast."}, "American Imperial Porter": {"pairing1": "Chicken Mole Enchiladas", "pairing2": "Smoked Gouda", "pairing3": "Blondie Butterscotch Brownies", "pairing1img": "Enchiladas.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "blondies.jpg", "glassimg": "tulip.jpg", "description": "Definitively American, the imperial porter should have no roasted barley flavors or strong burnt/black malt character. Medium caramel and cocoa-like sweetness is present, with complementing hop character and malt-derived sweetness."}, "American IPA": {"pairing1": "Spicy Tuna Roll", "pairing2": "Blue Cheeses ", "pairing3": "Persimmon Rice Pudding", "pairing1img": "Sushi.jpg", "pairing2img": "Bleu.jpg", "pairing3img": "RicePudding.jpg", "glassimg": "tulip.jpg", "description": "Characterized by floral, fruity, citrus-like, piney or resinous American-variety hop character, the IPA beer style is all about hop flavor, aroma and bitterness. This has been the most-entered category at the Great American Beer Festival for more than a decade, and is the top-selling craft beer style in supermarkets and liquor stores across the U.S."}, "American Lager": {"pairing1": "Pho", "pairing2": "Smear Ripened Cheeses", "pairing3": "Kettle Corn Balls", "pairing1img": "Pho.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "KettleCorn.jpg", "glassimg": "flute.jpg", "description": "American lager has little in the way of hop and malt character. A straw to gold, very clean and crisp, highly carbonated lager."}, "American Pale Ale": {"pairing1": "Roasted or Grilled Meats", "pairing2": "Mild or Medium Cheddar", "pairing3": "Apple Pie", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "ApplePie.jpg", "glassimg": "tulip.jpg", "description": "An American interpretation of a classic English style. The American pale ale is characterized by floral, fruity, citrus-like, piney, resinous, or sulfur-like American-variety hop character, producing medium to medium-high hop bitterness, flavor and aroma. American-style pale ales have medium body and low to medium maltiness that may include low caramel malt character."}, "American Stout": {"pairing1": "Grilled Lamb", "pairing2": "Sharp Cheddar", "pairing3": "Coffee Cake", "pairing1img": "Lamb.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "CoffeeCake.jpg", "glassimg": "pint.jpg", "description": "The American stout is a coffee- and chocolate-forward ale, but with a hop aroma and flavor, often from a citrus-forward variety. American stouts are bold, with a distinctive dry-roasted bitterness in the finish. Fruity esters should be low, but head retention high. The addition of oatmeal is acceptable in this style and lends to the body and head retention."}, "American-Style Wheat Wine Ale": {"pairing1": "Smoked Trout", "pairing2": "Asiago", "pairing3": "Peach Sorbet", "pairing1img": "SmokedFish.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "OrangeSorbet.jpg", "glassimg": "snifter.jpg", "description": "Part of the “strong ale” category, the American-Style Wheat Wine Ale is not derived from grapes as its name might suggest. Made with at least 50 percent wheat malt, this full-bodied beer features bready and candy flavors, and finishes with a great deal of malty sweetness. These beers may be oak-aged and sometimes have small amounts of darker malts added."}, "American Wheat": {"pairing1": "Salads, Seafood", "pairing2": "Chevre", "pairing3": "Fruit Desserts", "pairing1img": "ShellfishSalad.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "FruitDessert.jpg", "glassimg": "flute.jpg", "description": "Color is pale to light amber. This beer can be made using either ale or lager yeast. American wheat beer is generally brewed with at least 30 percent malted wheat. These beers are typically served with the yeast in the bottle, and pour cloudy. Traditionally more hoppy than a German hefeweizen, American wheat beer differs in that it should not offer flavors of banana or clove. It is a refreshing summer style. Darker versions of this style also exist but are not as common."}, "Baltic-Style Porter": {"pairing1": "Prime Rib", "pairing2": "Aged Gouda", "pairing3": "Deconstructed S'mores", "pairing1img": "PrimeRib.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "FancySmores.jpg", "glassimg": "pint.jpg", "description": "The Baltic-style Porter is a smooth, cold-fermented and cold-lagered beer brewed with lager yeast. Because of its alcoholic strength, it may include very low to low complex alcohol flavors and/or lager fruitiness such as berries, grapes and plums (but not banana; ale-like fruitiness from warm-temperature fermentation is not appropriate). This style has the malt flavors of a brown porter and the roast of a schwarzbier, but is bigger in alcohol and body."}, "Belgian-Style Blonde Ale": {"pairing1": "Sweet and Sour Chicken", "pairing2": "Brie", "pairing3": "Angel Food Cake", "pairing1img": "SweetNSour.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "AngelFood.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style blonde ale is typically easy-drinking, with a low but pleasing hop bitterness. This is a light- to medium-bodied ale, with a low malt aroma that has a spiced and sometimes fruity-ester character. Sugar is sometimes added to lighten the perceived body. This style is medium in sweetness and not as bitter as Belgian-style tripels or golden strong ales. It is usually brilliantly clear. The overall impression is balance between light sweetness, spice and low to medium fruity ester flavors."}, "Belgian-Style Dubbel": {"pairing1": "Apple-Smoked Sausage", "pairing2": "Washed-Rind Cheeses", "pairing3": "Milk Chocolate", "pairing1img": "Sausage.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "MilkChoco.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style dubbel ranges from brown to very dark in color. They have a malty sweetness and can have cocoa and caramel aromas and flavors. Hop bitterness is medium-low to medium. Yeast-generated fruity esters (especially banana) can be apparent. Often bottle-conditioned, a slight yeast haze and flavor may be evident. “Dubbel” meaning “double,” this beer is still not so big in intensity as to surpass the Belgian-style quadrupel that is often considered its sibling."}, "Belgian-Style Flanders": {"pairing1": "Beef Carbonnade", "pairing2": "Mimolette", "pairing3": "Pumpkin Pie", "pairing1img": "Carbonnade.jpg", "pairing2img": "Mimolette.jpg", "pairing3img": "PumpkinPie.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style Flanders is an ale with character and balance, thanks to lactic sourness and acetic acid. Cherry-like flavors are acceptable, as is malt sweetness that can lend bitterness and a cocoa-like character. Oak or other wood-like flavors may be present, even if the beer was not aged in barrels. Overall, the style is characterized by slight to strong lactic sourness, and Flanders “reds” sometimes include a balanced degree of acetic acid. Brettanomyces-produced flavors may be absent or very low. This style is a marvel in flavor complexity, combining malt, yeast, microorganisms, acidity and low astringency from barrel aging."}, "Belgian-Style Fruit Lambic": {"pairing1": "Pineapple Ceviche", "pairing2": "Chevre", "pairing3": "Chocolate Crème Caramel", "pairing1img": "PineappleCeviche.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "ChocoCremeCaramel.jpg", "glassimg": "tulip.jpg", "description": "Often known as cassis, framboise, kriek, or peche, a fruit lambic takes on the color and flavor of the fruit it is brewed with. It can be dry or sweet, clear or cloudy, depending on the ingredients. Notes of Brettanomyces yeast are often present at varied levels. Sourness is an important part of the flavor profile, though sweetness may compromise the intensity. These flavored lambic beers may be very dry or mildly sweet."}, "Belgian-Style Golden Strong Ale": {"pairing1": "Beer Battered Fried Shrimp", "pairing2": "Triple Crème", "pairing3": "Baklava", "pairing1img": "BeerShrimp.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "baklava.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style golden strong ale is fruity, complex and often on the higher end of the ABV spectrum, yet are approachable to many different palates. Look for a characteristic spiciness from Belgian yeast and a highly attenuated dry finish. This style is traditionally drier and lighter in color than a Belgian-style tripel."}, "Belgian-Style Lambic/Gueuze": {"pairing1": "Shellfish (Mussels)", "pairing2": "Mascarpone with Fruit", "pairing3": "Rich Chocolate Cake", "pairing1img": "mussels.jpg", "pairing2img": "MarscaponeFruit.jpg", "pairing3img": "RichDessert.jpg", "glassimg": "tulip.jpg", "description": "Belgian-style Lambic or Gueueze beers are naturally and spontaneously fermented with high to very high levels of esters, plus bacterial and yeast-derived sourness that sometimes includes acetic flavors. Lambics are not blended, while the gueuze style blends old and new lambics which are re-fermented in the bottle. Historically, they are dry and completely attenuated, exhibiting no residual sweetness either from malt, sugar or artificial sweeteners. Sweet versions may be created through the addition of sugars or artificial sweeteners. Many examples of this style are made to resemble the gueuze lambic beers of the Brussels area, where it originated."}, "Belgian-Style Pale Ale": {"pairing1": "Tempura Fried Fish and Chips", "pairing2": "Taleggio", "pairing3": "Savory Bread Pudding", "pairing1img": "FishChips.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "BreadPudding.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style pale ale is gold to copper in color and can have caramel or toasted malt flavor. The style is characterized by low but noticeable hop bitterness, flavor and aroma. These beers were inspired by British pale ales. They are very sessionable."}, "Belgian-Style Quadrupel": {"pairing1": "Roasted Duck", "pairing2": "Aged Gouda", "pairing3": "Bread Pudding", "pairing1img": "poultry.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "BreadPudding.jpg", "glassimg": "tulip.jpg", "description": "The Belgian-style Quadrupel is amber to dark brown in color. Caramel, dark sugar and malty sweet flavors dominate, with medium-low to medium-high hop bitterness. Quads have a relatively light body compared to their alcoholic strength. If aged, oxidative qualities should be mild and not distracting. Sometimes referred to as Belgian strong dark."}, "Belgian-Style Saison": {"pairing1": "Shellfish (Mussels)", "pairing2": "Brie", "pairing3": "Lemon Ginger Sorbet", "pairing1img": "mussels.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "OrangeSorbet.jpg", "glassimg": "tulip.jpg", "description": "Beers in this category are gold to light amber in color. Often bottle-conditioned, with some yeast character and high carbonation. Belgian-style saison may have Brettanomyces or lactic character, and fruity, horsey, goaty and/or leather-like aromas and flavors. Specialty ingredients, including spices, may contribute a unique and signature character. Commonly called “farmhouse ales” and originating as summertime beers in Belgium, these are not just warm-weather treats. U.S. craft brewers brew them year-round and have taken to adding a variety of additional ingredients."}, "Belgian-Style Tripel": {"pairing1": "Roasted Turkey", "pairing2": "Triple Crème", "pairing3": "Caramelized Banana Crème Brulee ", "pairing1img": "poultry.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "cremeb.jpg", "glassimg": "tulip.jpg", "description": "Complex, sometimes mild spicy flavor characterizes this style. Yeast-driven complexity is common. Tripels are often on the higher end of the ABV spectrum, yet are approachable to many different palates. These beers are commonly bottle-conditioned and finish dry. The Belgian-style tripel is similar to Belgian-style golden strong ales, but are generally darker and have a more noticeable malt sweetness."}, "Belgian-Style Witbier": {"pairing1": "Moules and Frites", "pairing2": "Mascarpone  ", "pairing3": "Panna Cotta", "pairing1img": "mussels.jpg", "pairing2img": "MarscaponeFruit.jpg", "pairing3img": "pannacotta.jpg", "glassimg": "tulip.jpg", "description": "Belgian-style witbier is brewed using unmalted wheat, sometimes oats and malted barley. Witbiers are spiced with coriander and orange peel. A style that dates back hundreds of years, it fell into relative obscurity until it was revived by Belgian brewer Pierre Celis in the 1960s. This style is currently enjoying a renaissance, especially in the American market. “Wit” means “white.”"}, "Berliner-Style Weisse": {"pairing1": "Aged Ham on Pretzel Bread", "pairing2": "Havarti", "pairing3": "Cheesecake with Raspberries", "pairing1img": "pretzel.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "pannacotta.jpg", "glassimg": "goblet.jpg", "description": "Low in alcohol, refreshingly tart, and often served with a flavored syrup like Woodruff or raspberry, the Berliner-style Weisse presents a harmony between yeast and lactic acid. These beers are very pale in color, and may be cloudy as they are often unfiltered. Hops are not a feature of this style, but these beers often do showcase esters. Traditional versions often showcase Brettanomyces yeast. Growing in popularity in the U.S., where many brewers are now adding traditional and exotic fruits to the recipe, resulting in flavorful finishes with striking, colorful hues. These beers are incredible when pairing. Bitterness, alcohol and residual sugar are very low, allowing the beer’s acidity, white bread and graham cracker malt flavors to shine. Carbonation is very high, adding to the refreshment factor this style delivers. Many examples of this style contain no hops and thus no bitterness at all."}, "French-Style Biere de Garde": {"pairing1": "Roasted Lamb with Mint", "pairing2": "Soft Ripened Cheeses", "pairing3": "Pecan Pie", "pairing1img": "Lamb.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "pecanpie.jpg", "glassimg": "tulip.jpg", "description": "Biere de Garde translates as “beer for keeping.” This style is popping up more and more from U.S. producers. Blond, amber and brown versions exist. Biere de garde examples are light amber to chestnut brown or red in color. This style is characterized by a toasted malt aroma and slight malt sweetness. Flavor of alcohol is evident. Often bottle-conditioned, with some yeast character."}, "Blonde Ale": {"pairing1": "Spaghetti and Meatballs", "pairing2": "Pepper Jack", "pairing3": "Sugar Cookies", "pairing1img": "spaghet.jpg", "pairing2img": "pjack.jpg", "pairing3img": "cookies.jpg", "glassimg": "tulip.jpg", "description": "One of the most approachable styles, a golden or blonde ale is an easy-drinking beer that is visually appealing and has no particularly dominating malt or hop characteristics. Rounded and smooth, it is an American classic known for its simplicity. Sometimes referred to as “golden ale.” These beers can have honey, spices and fruit added, and may be fermented with lager or ale yeast."}, "Bohemian-Style Pilsener": {"pairing1": "Shellfish, Chicken, Salads", "pairing2": "Mild White Cheddar", "pairing3": "Shortbread Cookies", "pairing1img": "ShellfishSalad.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "cookies.jpg", "glassimg": "flute.jpg", "description": "The Bohemian pilsener has a slightly sweet and evident malt character and a toasted, biscuit-like, bready malt character. Hop bitterness is perceived as medium with a low to medium-low level of noble-type hop aroma and flavor. This style originated in 1842, with “pilsener” originally indicating an appellation in the Czech Republic. Classic examples of this style used to be conditioned in wooden tanks and had a less sharp hop bitterness despite the similar IBU ranges to German-style pilsener. Low-level diacetyl is acceptable. Bohemian-style pilseners are darker in color and higher in final gravity than their German counterparts."}, "British-Style Barley Wine Ale": {"pairing1": "Moroccan Duck", "pairing2": "English Stilton", "pairing3": "Dark Chocolate", "pairing1img": "poultry.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "MilkChoco.jpg", "glassimg": "snifter.jpg", "description": "The barley wine is a strong ale that leans heavily on malt characteristics for flavor. With a wide color range and typically high in alcohol, this is a style that is often aged and will evolve well over time. As they advance in age, these beers develop oxidative characteristics including honey and toffee flavors and aromas, darker colors, lessened bitterness and more."}, "California Common": {"pairing1": "Pork Loin", "pairing2": "Feta", "pairing3": "Bread Pudding", "pairing1img": "pork.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "BreadPudding.jpg", "glassimg": "pint.jpg", "description": "The California common is brewed with lager yeast but fermented at ale fermentation temperatures. There is a noticeable degree of toasted malt and/or caramel-like malt character in flavor and often in aroma. Often referred to as “steam beer” and made famous by San Francisco’s Anchor Brewing Company. Seek out woody and mint flavor from the Northern Brewer hops."}, "Chocolate Beer": {"pairing1": "Venison Mole", "pairing2": "Aged Goat Cheeses", "pairing3": "Raspberry Torte", "pairing1img": "venisonmole.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "pannacotta.jpg", "glassimg": "snifter.jpg", "description": "This is an ale or lager that benefits from the addition of dark chocolate or cocoa. More common in porters, stouts and brown ales, where the grain bill better complements the confectionery ingredient, it can be added to other styles as well. Overt bitterness is not acceptable in this style. Little hop character is desired and the chocolate flavor does not need to be overwhelming. The style can vary greatly in approach and flavor profile depending on the brewer."}, "Coffee Beer": {"pairing1": "Pork Tenderloin", "pairing2": "Aged Semi-Hard Cheeses", "pairing3": "Vanilla Ice Cream", "pairing1img": "pork.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "vanilla.jpg", "glassimg": "pint.jpg", "description": "As the name suggests, this can be either a lager or ale with coffee added to boost flavor. While stouts and porters are popular base styles for coffee beer, many craft breweries are experimenting with other styles, like cream ales and India pale ales. Brewers may steep the beans in either water or beer to impart java flavor without adding acidity. Barrel-aged or wood-influenced versions may show signs of oxidation, including sherry notes and other advanced flavors."}, "Contemporary Gose": {"pairing1": "Watermelon Salad", "pairing2": "Queso Fresco", "pairing3": "Greek Yogurt Lemon Mousse", "pairing1img": "watermelonsalad.jpg", "pairing2img": "queso.jpg", "pairing3img": "LemonCustard.jpg", "glassimg": "flute.jpg", "description": "Straw to medium amber, the contemporary Gose is cloudy from suspended yeast. A wide variety of herbal, spice, floral or fruity aromas other than found in traditional Leipzig-Style Gose are present, in harmony with other aromas. Salt (table salt) character is traditional in low amounts, but may vary from absent to present. Body is low to medium-low. Low to medium lactic acid character is evident in all examples as sharp, refreshing sourness."}, "English-Style Bitter": {"pairing1": "Roasted Chicken, Fish and Chips", "pairing2": "Firm English Cheese", "pairing3": "Oatmeal Raisin Walnut Cookies", "pairing1img": "FishChips.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "oatmeal.jpg", "glassimg": "pint.jpg", "description": "The English-style bitter is a very sessionable, lower-alcohol, malt-driven style. Broad style description commonly associated with cask-conditioned beers. The light- to medium-bodied ordinary bitter is gold to copper in color, with a low residual malt sweetness. Hop bitterness is medium."}, "English-Style Brown Ale": {"pairing1": "Roasted Pork, Steak, Nuts", "pairing2": "Aged Gouda", "pairing3": "Pear Fritters", "pairing1img": "pork.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "Fritter.jpg", "glassimg": "pint.jpg", "description": "The English-style brown ale ranges from dryer (Northern English) to sweeter (Southern English) maltiness. Roast malt tones (chocolate, nutty) may sometimes contribute to the flavor and aroma profile. Hop bitterness is very low to low, with very little hop flavor and aroma. Known for rich and advanced malt aroma and flavor without centering too much on hops, the English-style mild is extremely sessionable and food-friendly."}, "English-Style Brown Porter": {"pairing1": "Roasted or Grilled Meats", "pairing2": "Gruyere", "pairing3": "Chocolate Peanut Butter Cookies", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "chocopb.jpg", "glassimg": "pint.jpg", "description": "The English-style brown porter has no roasted barley or strong burnt/black malt character. Low to medium malt sweetness, caramel and chocolate is acceptable. Hop bitterness is medium. Softer, sweeter and more caramel-like than a robust porter, with less alcohol and body. Porters are the precursor style to stouts."}, "English-Style Mild": {"pairing1": "Mushrooms and Wild Game", "pairing2": "Mild Cheddar", "pairing3": "Dark Fruit Tart", "pairing1img": "shrooms.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "FruitDessert.jpg", "glassimg": "pint.jpg", "description": "Malt and caramel are part of the flavor and aroma profile of the English-style mild while licorice and roast malt tones may sometimes contribute as well. Hop bitterness is very low to low. U.S. brewers are known to make lighter-colored versions as well as the more common “dark mild.” These beers are very low in alcohol, yet often are still medium-bodied due to increased dextrin malts."}, "English-Style IPA": {"pairing1": "Fettuccine Alfredo", "pairing2": "Aged Cheddar", "pairing3": "Ginger Spice Cake", "pairing1img": "whitesauce.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "spice.jpg", "glassimg": "pint.jpg", "description": "Steeped in lore (and extra hops), the IPA is a stronger version of a pale ale. The English-style IPA is characterized by stiff English-style hop character (earthy, floral) and increased alcohol content. English yeast lends a fruity flavor and aroma. Different from its American counterpart, this style strikes a balance between malt and hops for a more rounded flavor. There is also a lot of mythology surrounding the creation of this style, which is still debated today."}, "English-Style Oatmeal Stout": {"pairing1": "Chicken in Mole Sauce", "pairing2": "Aged Cheddar", "pairing3": "Sweet Potato Cheesecake", "pairing1img": "Enchiladas.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "spcheese.jpg", "glassimg": "pint.jpg", "description": "The addition of oatmeal adds a smooth, rich body to the oatmeal stout. This beer style is dark brown to black in color. Roasted malt character is caramel-like and chocolate-like, and should be smooth and not bitter. Coffee-like roasted barley and malt aromas are prominent. This low- to medium-alcohol style is packed with darker malt flavors and a rich and oily body from oatmeal."}, "English-Style Old Ale": {"pairing1": "Roast Beef and Lamb", "pairing2": "Double Gloucester", "pairing3": "Spiced Plum Walnut Tart", "pairing1img": "Lamb.jpg", "pairing2img": "OrangeCheese.jpg", "pairing3img": "pecanpie.jpg", "glassimg": "snifter.jpg", "description": "A distinctive quality of these ales is that their yeast undergoes an aging process (often for years) in bulk storage or through bottle conditioning, which contributes to a rich, wine-like and often sweet oxidation character. Old ales are copper-red to very dark in color. Complex estery character may emerge."}, "English-Style Pale Ale (ESB)": {"pairing1": "Roasted Chicken, Fish and Chips", "pairing2": "English-Style Cheeses", "pairing3": "Maple Bread Pudding", "pairing1img": "FishChips.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "BreadPudding.jpg", "glassimg": "pint.jpg", "description": "ESB stands for “extra special bitter.” This style is known for its balance and the interplay between malt and hop bitterness. English pale ales display earthy, herbal English-variety hop character. Medium to high hop bitterness, flavor and aroma should be evident. The yeast strains used in these beers lend a fruitiness to their aromatics and flavor, referred to as esters. The residual malt and defining sweetness of this richly flavored, full-bodied bitter is medium to medium-high."}, "English-Style Sweet Stout (Milk Stout)": {"pairing1": "Mexican Mole, Spicy BBQ", "pairing2": "Buttery Cheddar", "pairing3": "Chocolate Cake, Ice Cream", "pairing1img": "Enchiladas.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "ChocoCake.jpg", "glassimg": "pint.jpg", "description": "Sweet stout, also referred to as cream stout or milk stout, is black in color. Malt sweetness, chocolate and caramel should dominate the flavor profile and contribute to the aroma. It also should have a low to medium-low roasted malt/barley-derived bitterness. Milk sugar (lactose) lends the style more body. This beer does use lactose sugar, so people with an intolerance should probably avoid this style."}, "European-Style Export": {"pairing1": "Grilled Steak", "pairing2": "Chevre", "pairing3": "Bread Pudding", "pairing1img": "steak.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "BreadPudding.jpg", "glassimg": "flute.jpg", "description": "Sometimes referred to as a “Dortmunder export,” the European-Style Export has the malt-forward flavor and sweetness of a German-style helles, but the bitter base of a German-style pilsener. This lager is all about balance, with medium hop character and firm but low malt sweetness. Look for toasted malt flavors and spicy floral hop aromas."}, "Fruit and Field Beer": {"pairing1": "Salads ", "pairing2": "Creamy Cheeses", "pairing3": "Vanilla Ice Cream", "pairing1img": "ShellfishSalad.jpg", "pairing2img": "SoftCheese.jpg", "pairing3img": "vanilla.jpg", "glassimg": "tulip.jpg", "description": "Fruit beer is made with fruit, or fruit extracts that are added during any portion of the brewing process, providing obvious yet harmonious fruit qualities. This idea is expanded to “field beers” that utilize vegetables and herbs."}, "German-Style Bock": {"pairing1": "Grilled Rib-Eye", "pairing2": "Aged Swiss", "pairing3": "Chocolate", "pairing1img": "steak.jpg", "pairing2img": "swiss.png", "pairing3img": "MilkChoco.jpg", "glassimg": "tulip.jpg", "description": "Traditional bock beers are all-malt brews and are high in malt sweetness. Malt character should be a balance of sweetness and toasted or nut-like malt. “Bock” translates as “goat”!"}, "German-Style Brown/Altbier": {"pairing1": "Grilled Salmon", "pairing2": "Emmental", "pairing3": "Apple Pie", "pairing1img": "SmokedFish.jpg", "pairing2img": "swiss.png", "pairing3img": "ApplePie.jpg", "glassimg": "tulip.jpg", "description": "Originally from the Düsseldorf area of Germany, the German-Style Brown/Altbier strikes a balance between hop and malt flavors and aromas, but can have low fruity esters and some peppery and floral hop aromas. Before Germany had lager beer, it had ales. Alt, meaning “old,” pays homage to one rebel region in Germany which did not lean into lagering. U.S. producers celebrate the ale revolution beautifully with this top-fermented German beer style."}, "German-Style Doppelbock": {"pairing1": "Pork or Ham", "pairing2": "Strong Cheeses", "pairing3": "German Chocolate Cake", "pairing1img": "pork.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "ChocoCake.jpg", "glassimg": "tulip.jpg", "description": "“Doppel” meaning “double,” this style is a bigger and stronger version of the lower-gravity German-style bock beers. Originally made by monks in Munich, the doppelbock beer style is very food-friendly and rich in melanoidins reminiscent of toasted bread. Color is copper to dark brown. Malty sweetness is dominant but should not be cloying. Malt character is more reminiscent of fresh and lightly toasted Munich-style malt, more so than caramel or toffee malt. Doppelbocks are full-bodied, and alcoholic strength is on the higher end."}, "German-Style Dunkel": {"pairing1": "Sausages, Roasted Vegetables", "pairing2": "Washed-Rind Munster", "pairing3": "Candied Ginger Beer Cake", "pairing1img": "Sausage.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "spice.jpg", "glassimg": "tulip.jpg", "description": "A German-style dunkel, sometimes referred to as a Munchner dunkel, should have chocolate-like, roast malt, bread-like or biscuit-like aromas that come from the use of Munich dark malt. This beer does not offer an overly sweet impression, but rather a mild balance between malt sweetness and hop character."}, "German-Style Dunkelweizen": {"pairing1": "Roasted Chicken ", "pairing2": "Gouda", "pairing3": "Banana Cream Pie", "pairing1img": "poultry.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "creampie.jpg", "glassimg": "stein.jpg", "description": "The German-style Dunkelweizen can be considered a cross between a German-style dunkel and a hefeweizen. Distinguished by its sweet maltiness and chocolate-like character, it can also have banana and clove (and occasionally vanilla or bubblegum) esters from weizen ale yeast."}, "German-Style Hefeweizen": {"pairing1": "Seafood", "pairing2": "Chevre", "pairing3": "Key Lime Pie", "pairing1img": "mussels.jpg", "pairing2img": "Chevre.jpg", "pairing3img": "creampie.jpg", "glassimg": "stein.jpg", "description": "The German-style hefeweizen is straw to amber in color and made with at least 50 percent malted wheat. The aroma and flavor of a weissbier comes largely from the yeast and is decidedly fruity (banana) and phenolic (clove). “Weizen” means “wheat” and “hefe” means “yeast.” There are multiple variations to this style. Filtered versions are known as “Kristal Weizen” and darker versions are referred to as “Dunkels,” with a stronger, bock-like version called “Weizenbock.” This is commonly a very highly carbonated style with a long-lasting collar of foam."}, "German-Style Maibock": {"pairing1": "Ham", "pairing2": "Swiss", "pairing3": "White Chocolate Cheesecake", "pairing1img": "pork.jpg", "pairing2img": "swiss.png", "pairing3img": "pannacotta.jpg", "glassimg": "goblet.jpg", "description": "Also called “heller bock” (meaning “pale bock”), the German-style Maibock is paler in color and more hop-centric than traditional bock beers. A lightly toasted and/or bready malt character is often evident."}, "German-Style Helles": {"pairing1": "Samosas", "pairing2": "Colby", "pairing3": "Baklava", "pairing1img": "samosa.jpg", "pairing2img": "OrangeCheese.jpg", "pairing3img": "baklava.jpg", "glassimg": "flute.jpg", "description": "“Helles” means “pale in color,” as these beers are often golden. The German-style Helles is similar in flavor to adjunct-influenced lagers, but possess more advanced pilsener malt flavor and have a touch more sweetness, and are less dry in the finish. A full-bodied lager that puts pilsener malt flavors forward and can be perceived as bready. A slight sweetness permeates with just a hint of hop spiciness. Clean and crisp, this is a refreshing beer with substance. Low levels of yeast-produced sulfur aromas and flavors may be common."}, "German-Style Kolsch": {"pairing1": "Bratwurst", "pairing2": "Nutty Cheeses", "pairing3": "Light Apricot Cake", "pairing1img": "Sausage.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "FruitDessert.jpg", "glassimg": "flute.jpg", "description": "The German-style Kolsch is light in color and malt character. This style’s fermentation process yields a light vinous character which is accompanied by a slightly dry, crisp finish. Ale yeast is used for fermentation, though lager yeast is sometimes used in the bottle or final cold-conditioning process."}, "German-Style Marzen/Oktoberfest": {"pairing1": "Kielbasa", "pairing2": "Jalapeno Jack", "pairing3": "Coconut Flan", "pairing1img": "Sausage.jpg", "pairing2img": "pjack.jpg", "pairing3img": "pannacotta.jpg", "glassimg": "flute.jpg", "description": "A beer rich in malt with a balance of clean, hop bitterness. Bread or biscuit-like malt aroma and flavor is common. Originating in Germany, this style used to be seasonally available in the spring (“Marzen” meaning “March”), with the fest-style versions tapped in October."}, "German-Style Pilsener": {"pairing1": "Shellfish, Chicken, Salads", "pairing2": "White Cheddar", "pairing3": "Shortbread Cookies", "pairing1img": "ShellfishSalad.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "cookies.jpg", "glassimg": "flute.jpg", "description": "A classic German-style pilsener is straw to pale in color. A malty residual sweetness can be perceived in aroma and flavor. Perception of hop bitterness is medium to high. Noble-type hop aroma and flavor are moderate and quite obvious. Distinctly different from Bohemian-style pilsener, this style is lighter in color and body and has a lower perceived hop bitterness."}, "German-Style Schwarzbier": {"pairing1": "Mushroom Strudel", "pairing2": "Munster-Style Cheese", "pairing3": "Fruit Tart", "pairing1img": "shrooms.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "FruitDessert.jpg", "glassimg": "flute.jpg", "description": "Sometimes called black lagers, they may remind some of German-style dunkels, but schwarzbiers are drier, darker and more roast-oriented.These very dark brown to black beers have a surprisingly pale-colored foam head (not excessively brown) with good cling quality. They have a mild roasted malt character without the associated bitterness. Malt flavor and aroma is at low to medium levels of sweetness."}, "German-Style Weizenbock": {"pairing1": "Chicken and Dumplings", "pairing2": "Manchego", "pairing3": "Banana Bread", "pairing1img": "chickendump.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "PoundCake.jpg", "glassimg": "tulip.jpg", "description": "The German-style Weizenbock is a wheat version of a German-style bock, or a bigger and beefier dunkelweizen. Malt mellanoidins and weizen ale yeast are the star ingredients. If served with yeast, the appearance may appropriately be very cloudy. With flavors of bready malt and dark fruits like plum, raisin, and grape, this style is low on bitterness and high on carbonation. Balanced clove-like phenols and fruity, banana-like esters produce a well-rounded aroma."}, "Imperial India Pale Ale": {"pairing1": "Bone-In Pork Chops, Miso Salmon", "pairing2": "Rich Cheeses", "pairing3": "Carrot Cake", "pairing1img": "SmokedFish.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "spice.jpg", "glassimg": "tulip.jpg", "description": "The imperial India Pale Ale features high hop bitterness, flavor and aroma. Hop character is fresh and evident from utilization of any variety of hops. Alcohol content is medium-high to high and notably evident with a medium-high to full body. The intention of this style is to exhibit the fresh and evident character of hops."}, "Irish-Style Dry Stout": {"pairing1": "Seafood (Oysters), Ham", "pairing2": "Irish Cheddar", "pairing3": "Chocolate Desserts", "pairing1img": "pork.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "ChocoCake.jpg", "glassimg": "pint.jpg", "description": "Dry stout is black beer with a dry-roasted character thanks to the use of roasted barley. The emphasis on coffee-like roasted barley and a moderate degree of roasted malt aromas define much of the character. Hop bitterness is medium to medium high. This beer is often dispensed via nitrogen gas taps that lend a smooth, creamy body to the palate."}, "Irish-Style Red": {"pairing1": "Roasted Vegetables", "pairing2": "Cheddar", "pairing3": "Poached Pears", "pairing1img": "roastveg.jpg", "pairing2img": "Cheese.jpg", "pairing3img": "pear.jpg", "glassimg": "pint.jpg", "description": "This is a balanced beer that uses a moderate amount of kilned malts and roasted barley to give the color for which it’s named. With a medium hop characteristic on the palate, this typically amber-colored beer is brewed as a lager or ale and can have a medium candy-like caramel malt sweetness. This style may contain adjuncts such as corn, rice and sugar, which help dry out the finish and lessen the body. It also often contains roasted barley, lending low roasted notes, darker color and possibly creating a tan collar of foam. With notes of caramel, toffee and sometimes low-level diacetyl (butter), think of this beer style as a cousin to lightly-toasted and buttered bread."}, "New England IPA": {"pairing1": "Hawaiian Pork Tenderloin", "pairing2": "Goat Blue", "pairing3": "Macha Crème Brulee", "pairing1img": "pork.jpg", "pairing2img": "Bleu.jpg", "pairing3img": "matcha.jpg", "glassimg": "pint.jpg", "description": "Emphasizing hop aroma and flavor without bracing bitterness, the New England IPA  leans heavily on late and dry hopping techniques to deliver a bursting juicy, tropical hop experience. The skillful balance of technique and ingredient selection, often including the addition of wheat or oats, lends an alluring haze to this popular take on the American IPA."}, "Robust Porter": {"pairing1": "Roasted or Grilled Meats", "pairing2": "Gruyere", "pairing3": "Chocolate Peanut Butter Cookies", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "HardCheese.jpg", "pairing3img": "chocopb.jpg", "glassimg": "pint.jpg", "description": "The Robust Porter features more bitter and roasted malt flavor than a brown porter, but not quite as much as a stout. Robust porters have a roast malt flavor, often reminiscent of cocoa, but no roast barley flavor. Their caramel and malty sweetness is in harmony with the sharp bitterness of black malt. Hop bitterness is evident. With U.S. craft brewers doing so much experimentation in beer styles and ingredients, the lines between certain stouts and porters are often blurred. Yet many deliberate examples of these styles do exist. Diacetyl is acceptable at very low levels."}, "Scotch Ale/Wee Heavy": {"pairing1": "Variety of Meats and Game", "pairing2": "Pungent Cheeses", "pairing3": "Creamy Desserts with Fruit", "pairing1img": "Lamb.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "MarscaponeFruit.jpg", "glassimg": "thistle.jpg", "description": "The Scotch ale is overwhelmingly malty, with a rich and dominant sweet malt flavor and aroma. A caramel character is often part of the profile. Some examples feature a light smoked peat flavor. This style could be considered the Scottish version of an English-style barley wine. Overly smoked versions would be considered specialty examples."}, "Scottish-Style Ale": {"pairing1": "Variety of Meats and Game", "pairing2": "Pungent Cheeses", "pairing3": "Creamy Desserts with Fruit", "pairing1img": "Lamb.jpg", "pairing2img": "WashedRind.jpg", "pairing3img": "MarscaponeFruit.jpg", "glassimg": "thistle.jpg", "description": "Scottish-style ales vary depending on strength and flavor, but in general retain a malt-forward character with some degree of caramel-like malt flavors and a soft and chewy mouthfeel. Some examples feature a light smoked peat flavor. Hops do not play a huge role in this style. The numbers commonly associated with brands of this style (60/70/80 and others) reflect the Scottish tradition of listing the cost, in shillings, of a hogshead (large cask) of beer. Overly smoked versions would be considered specialty examples. Smoke or peat should be restrained."}, "Session Beer": {"pairing1": "", "pairing2": "", "pairing3": "", "pairing1img": "", "pairing2img": "", "pairing3img": "", "glassimg": "pint.jpg", "description": "Session beer is not defined by flavors or aromas, which can place it in almost any style category. Instead, what makes a session beer is primarily refreshment and drinkability. Any style of beer can be made lower in strength than described in the classic style guidelines. The goal should be to reach a balance between the style’s character and the lower alcohol content. Drinkability is a factor in the overall balance of these beers. Beer should not exceed 5 percent ABV."}, "Smoke Porter": {"pairing1": "Grilled Sausage", "pairing2": "Red Dragon Cheddar", "pairing3": "S'mores", "pairing1img": "Sausage.jpg", "pairing2img": "Cheese2CheeseStrikesBack.jpg", "pairing3img": "FancySmores.jpg", "glassimg": "pint.jpg", "description": "Typically the base for the smoke porter beer style is a robust porter that is given smoky depth thanks to wood-smoked malt. Traditionally, brewers will cite the specific wood used to smoke the malt, and different woods will lend different flavors to the finished product. Smoke flavors dissipate over time."}, "Vienna-Style Lager": {"pairing1": "Grilled Meats and Vegetables", "pairing2": "Mild Cheeses", "pairing3": "Almond Biscotti", "pairing1img": "GrilledMeatVeg.jpg", "pairing2img": "Gouda.jpg", "pairing3img": "bisc.jpg", "glassimg": "flute.jpg", "description": "Vienna Lager ranges from copper to reddish brown in color. The beer is characterized by malty aroma and slight malt sweetness. The malt aroma and flavor should have a notable degree of toasted and/or slightly roasted malt character. Hop bitterness is low to medium-low."}}